app/controllers/games_controller.rb

INSERT INTO "games" ("game", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["game", 2466479406], ["created_at", "2019-02-13 16:38:08.954516"], ["updated_at", "2019-02-13 16:38:08.954516"]]
---
  def create
    game = Game.create(game_params)

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "summoners".* FROM "summoners" WHERE "summoners"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def show
    @game = Game.find(params['id'])
    @summoner = Summoner.find(session[:summoner_id])