app/controllers/summoners_controller.rb

    def create

        @summoner = Summoner.new(summoner_name: summoner_params)
        profile = @summoner.league_profile
        if profile != 404
            @summoner.save
            session[:summoner_id] = Summoner.last.id
---
INSERT INTO "summoners" ("summoner_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["summoner_name", "joncher"], ["created_at", "2019-02-12 18:43:03.630242"], ["updated_at", "2019-02-12 18:43:03.630242"]]
SELECT  "summoners".* FROM "summoners" ORDER BY "summoners"."id" DESC LIMIT $1  [["LIMIT", 1]]