app/controllers/summoners_controller.rb

    def create

        @summoner = Summoner.find_or_initialize_by(summoner_name: summoner_params)
        profile = @summoner.league_profile
        if profile != 404
            @summoner.acc_id = profile["accountId"]
            @summoner.save
---
SELECT  "summoners".* FROM "summoners" WHERE "summoners"."summoner_name" = $1 LIMIT $2  [["summoner_name", "Simonoski"], ["LIMIT", 1]]
UPDATE "summoners" SET "acc_id" = $1, "updated_at" = $2 WHERE "summoners"."id" = $3  [["acc_id", "Kj32dgxaR1LHFN6owRFbn10kiZNbDCE-3HP7QW2Sg2Y8Bw"], ["updated_at", "2019-02-15 14:35:11.071033"], ["id", 1]]

    def edit
      @summoner = Summoner.find(params[:id])
---
SELECT  "summoners".* FROM "summoners" WHERE "summoners"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

    def update
      @summoner = Summoner.find(params[:id])
      @summoner[:summoner_name] = summoner_params
      profile = @summoner.league_profile
      if profile != 404
          @summoner[:acc_id] = profile["accountId"]
          @summoner.save
          session[:summoner_id] = Summoner.find(params[:id])
---
SELECT  "summoners".* FROM "summoners" WHERE "summoners"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "summoners" SET "summoner_name" = $1, "acc_id" = $2, "updated_at" = $3 WHERE "summoners"."id" = $4  [["summoner_name", "Yassuo"], ["acc_id", "CLwTahBrwSG9X1IxuDhGvW7cWVkSrc4H9RLqLaTgtaU"], ["updated_at", "2019-02-15 16:36:48.289688"], ["id", 69]]
SELECT  "summoners".* FROM "summoners" WHERE "summoners"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]

    def show
      session[:summoner_id] = params['id']
      @summoner = Summoner.find(params['id'])
---
SELECT  "summoners".* FROM "summoners" WHERE "summoners"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

    def destroy
      session.delete :summoner_id
---
DELETE FROM "summoners" WHERE "summoners"."id" = $1  [["id", 20]]