app/views/layouts/application.html.erb

SELECT  "summoners".* FROM "summoners" WHERE "summoners"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  <% if !session[:summoner_id].nil? %>
  <% @summoner = Summoner.find(session[:summoner_id])%>